package lanqiao.q2376;

import java.util.Scanner;
// 1:无需package
// 2: 类名必须Main, 不可修改

/**
 * 小蓝在蓝桥杯练习系统上做题。做到一道题, 他编写好程序, 在自己的电 脑上尝试了题目中提供的几个样例, 全部得到了正确的结果, 可是当他将自己 的程序提交到练习系统上时, 却得了 0 分, 这种情况可能的原因是什么? 请在 以下选项中选择所有可能导致这种情况的原因。
 * <p>
 * A. 题目中的样例一般比较小, 在评测的时候可能使用的评测用例比较大, 小蓝的程序虽然在小样例能得到解, 对于大一些的评测用例可能速度太慢, 超 过了题目要求的时间限制。
 * <p>
 * B. 小蓝的内存使用过多, 虽然在自己的电脑上运行正确, 可是在评测的内存限制下无法运行。
 * <p>
 * C. 小蓝的程序有考虑不足之处, 题目中的样例比较小, 小蓝的程序恰好能 得到对应的结果, 可是当评测用例比较复杂时, 小蓝的程序无法得到正确的结 果。
 */
public class Main {
    public static void main(String[] args) {
        Scanner scan = new Scanner(System.in);
        //在此输入您的代码...
        System.out.println("ABC");
        scan.close();
    }
}