package lanqiao.thirdMoNi.tenth;

/**
 * 问题描述
 * 　　小蓝有一个序列 a[1], a[2], ..., a[n]。
 * 　　给定一个正整数 k，请问对于每一个 1 到 n 之间的序号 i，a[i-k], a[i-k+1], ..., a[i+k] 这 2k+1 个数中的最小值是多少？当某个下标超过 1 到 n 的范围时，数不存在，求最小值时只取存在的那些值。
 * 输入格式
 * 　　输入的第一行包含一整数 n。
 * 　　第二行包含 n 个整数，分别表示 a[1], a[2], ..., a[n]。
 * 　　第三行包含一个整数 k 。
 * 输出格式
 * 　　输出一行，包含 n 个整数，分别表示对于每个序号求得的最小值。
 * 样例输入
 * 5
 * 5 2 7 4 3
 * 1
 * 样例输出
 * 2 2 2 3 3
 * 评测用例规模与约定
 * 　　对于 30% 的评测用例，1 <= n <= 1000，1 <= a[i] <= 1000。
 * 　　对于 50% 的评测用例，1 <= n <= 10000，1 <= a[i] <= 10000。
 * 　　对于所有评测用例，1 <= n <= 1000000，1 <= a[i] <= 1000000。
 *
 * @author <a href="https://roozen.top">Roozen</a>
 * @version 1.0
 */
public class Main {
    public static void main(String[] args) {

    }
}
